benchmarks/2023-Oct-08_114315/go-chi.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        
Server Hostname:        0.0.0.0
Server Port:            2000

Document Path:          /api/echo
Document Length:        92 bytes

Concurrency Level:      100
Time taken for tests:   0.626 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2000000 bytes
Total body sent:        2460000
HTML transferred:       920000 bytes
Requests per second:    15964.67 [#/sec] (mean)
Time per request:       6.264 [ms] (mean)
Time per request:       0.063 [ms] (mean, across all concurrent requests)
Transfer rate:          3118.10 [Kbytes/sec] received
                        3835.26 kb/s sent
                        6953.36 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.5      2       4
Processing:     1    4   7.2      3      92
Waiting:        0    3   7.2      2      92
Total:          3    6   7.1      5      93

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      5
  80%      5
  90%      6
  95%      6
  98%     30
  99%     57
 100%     93 (longest request)