benchmarks/2023-Oct-08_114315/javascript-node.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        
Server Hostname:        0.0.0.0
Server Port:            2000

Document Path:          /api/echo
Document Length:        91 bytes

Concurrency Level:      100
Time taken for tests:   2.271 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2980000 bytes
Total body sent:        2460000
HTML transferred:       910000 bytes
Requests per second:    4403.62 [#/sec] (mean)
Time per request:       22.709 [ms] (mean)
Time per request:       0.227 [ms] (mean, across all concurrent requests)
Transfer rate:          1281.52 [Kbytes/sec] received
                        1057.90 kb/s sent
                        2339.42 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:    11   22   6.6     20      96
Waiting:        9   22   6.5     20      95
Total:         11   22   6.7     21      96

Percentage of the requests served within a certain time (ms)
  50%     21
  66%     21
  75%     22
  80%     24
  90%     29
  95%     30
  98%     36
  99%     53
 100%     96 (longest request)