benchmarks/2023-Oct-08_114315/rust-axum.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient)


Server Software:        
Server Hostname:        0.0.0.0
Server Port:            2000

Document Path:          /api/echo
Document Length:        91 bytes

Concurrency Level:      100
Time taken for tests:   0.647 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1990000 bytes
Total body sent:        2460000
HTML transferred:       910000 bytes
Requests per second:    15458.34 [#/sec] (mean)
Time per request:       6.469 [ms] (mean)
Time per request:       0.065 [ms] (mean, across all concurrent requests)
Transfer rate:          3004.11 [Kbytes/sec] received
                        3713.62 kb/s sent
                        6717.74 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.8      2       7
Processing:     1    4   8.7      3      79
Waiting:        0    3   8.7      1      79
Total:          3    6   8.5      5      80

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      5
  80%      5
  90%      6
  95%      8
  98%     45
  99%     66
 100%     80 (longest request)